# Brewfile - Install with: brew bundle
# Update with: brew bundle dump --force

# Taps
tap "anomalyco/tap"
tap "github/gh"
tap "homebrew/cask-fonts"
tap "oven-sh/bun"

#==============================================================================
# Core CLI Tools
#==============================================================================
brew "ack"                            # Grep-like tool for programmers
brew "ast-grep"             # Code search/refactor
brew "bat"                  # Better cat
brew "brotli"                           # Lossless compression
brew "btop"                 # Resource monitor
brew "cmake"                            # Cross-platform make
brew "chafa"                # Terminal image viewer (yazi fallback)
brew "cmatrix"              # Matrix screensaver
brew "coreutils"                         # GNU utilities
brew "curl"                             # URL transfer tool
brew "dust"                 # Better du
brew "eza"                  # Better ls
brew "fd"                   # Better find
brew "fastfetch"            # System info
brew "ffmpeg"               # Media processing
brew "fzf"                  # Fuzzy finder
brew "gnupg"                # GPG encryption
brew "docker"                            # Container platform
brew "docker-completion"                 # Docker completions
brew "gdbm"                              # Database library
brew "gettext"                           # i18n library
brew "grep"                              # GNU grep
brew "gti"                  # Fun typo for git
brew "htop"                 # Process viewer
brew "imagemagick"                        # Image tools
brew "jasper"                             # JPEG-2000 library
brew "jq"                   # JSON processor
brew "little-cms2"                        # Color management
brew "ossp-uuid"                          # UUID generator
brew "pkg-config"                         # Package metadata
brew "procs"                # Better ps
brew "readline"                           # Line editing library
brew "ripgrep"              # Fast grep (rg)
brew "rust"                               # Systems programming language
brew "sd"                   # Better sed
brew "tmux"                              # Terminal multiplexer
brew "tokei"                # Code statistics
brew "wget"                              # File downloader
brew "xclip"                             # Clipboard access
brew "xz"                   # File compression
brew "yazi"                 # File browser
brew "zoxide"               # Smart cd

#==============================================================================
# Development - General
#==============================================================================
brew "awscli"                            # AWS CLI
brew "aws-vault"            # AWS credentials manager
brew "emacs"                             # Text editor
brew "gh"                   # GitHub CLI
brew "git-delta"            # Better git diffs
brew "git-lfs"                           # Large file storage
brew "mob"                  # Mob programming tool
brew "neovim"                            # Hyperextensible Vim
brew "qt"                                # Application framework
brew "tig"                  # Git TUI

#==============================================================================
# Development - Kubernetes
#==============================================================================
brew "helm"                              # Kubernetes package manager
brew "kubernetes-cli"                    # kubectl
brew "kubectx"                           # kubectl context switcher
brew "k9s"                               # Kubernetes CLI UI

#==============================================================================
# Development - Java/JVM
#==============================================================================
brew "gradle"                            # Java build tool
brew "openjdk"                           # Java JDK
brew "sbt"                               # Scala build tool

#==============================================================================
# Development - Python
#==============================================================================
brew "pyenv"                             # Python version manager
brew "ruff"                              # Python linter
brew "uv"                   # Fast pip replacement

#==============================================================================
# Development - Node.js
#==============================================================================
brew "oven-sh/bun/bun"                   # JavaScript runtime
brew "n"                    # Node version manager
brew "pnpm"                              # Node package manager

#==============================================================================
# Databases
#==============================================================================
brew "duckdb"                            # SQL OLAP database
brew "postgresql@16"                     # PostgreSQL RDBMS
brew "pgvector"                          # Postgres vector search
brew "redis"                             # In-memory data store
brew "sqlite"                            # Self-contained database

#==============================================================================
# AI Tools
#==============================================================================
brew "anomalyco/tap/gifgrep"  # Clawdbot skill: GIF search
brew "anomalyco/tap/goplaces" # Clawdbot skill: Google Places
brew "anomalyco/tap/imsg"     # Clawdbot skill: iMessage
brew "anomalyco/tap/opencode" # AI coding assistant CLI
brew "huggingface-cli"      # HuggingFace model downloads
brew "llm"                  # CLI for LLMs
brew "ollama"               # Run LLMs locally

#==============================================================================
# Helpers
#==============================================================================
brew "bash-completion"                   # Bash programmable completion
brew "mas"                  # Mac App Store CLI
brew "thefuck"              # Command correction
brew "tldr"                 # Simplified man pages

#==============================================================================
# Casks - Development Apps
#==============================================================================
cask "1password-cli"               # 1Password CLI
cask "chatgpt"                  # OpenAI ChatGPT app
cask "claude"                   # Anthropic Claude app
cask "cursor"                   # AI-powered code editor
cask "ghostty"              # Terminal
cask "github"               # GitHub Desktop
cask "jetbrains-toolbox"         # JetBrains tools manager
cask "kiro"                     # Agent-centric IDE
cask "lm-studio"                # Local LLM runner
cask "opencode-desktop"     # AI coding assistant
cask "openlens"             # Kubernetes IDE
cask "postman"                  # API collaboration platform
cask "zed"                  # Editor

#==============================================================================
# Casks - General Apps
#==============================================================================
cask "adobe-creative-cloud"     # Adobe creative apps
cask "arc"                  # Browser
cask "conductor"                # Claude code tool
cask "dropbox"                  # Cloud storage client
cask "firefox"                  # Mozilla web browser
cask "mactex"                   # TeX Live distribution
cask "opal-composer"            # Opal webcam software
cask "raycast"                  # Spotlight launcher
cask "reflect"                  # Networked note app
cask "spotify"                  # Music streaming
cask "todoist-app"              # Todo list app
cask "zoom"                     # Video meetings

#==============================================================================
# Casks - Messaging
#==============================================================================
cask "discord"                  # Voice/text chat
cask "slack"                    # Team chat app
cask "telegram"                 # Secure messenger
cask "whatsapp"                 # WhatsApp desktop

#==============================================================================
# Fonts
#==============================================================================
cask "font-hack"                # Hack monospace font
cask "font-hack-nerd-font"      # Hack Nerd Font
cask "font-monaspace"           # Monaspace font family
cask "font-monaspice-nerd-font" # Monaspice Nerd Font
cask "font-symbols-only-nerd-font"   # Symbols Nerd Font
