# Brewfile - Install with: brew bundle
# Update with: brew bundle dump --force

# Taps
tap "github/gh"
tap "homebrew/cask-fonts"
tap "oven-sh/bun"

#==============================================================================
# Core CLI Tools
#==============================================================================
brew "ack"
brew "bat"                  # Better cat
brew "brotli"
brew "btop"                 # Resource monitor
brew "cmake"
brew "coreutils"
brew "curl"
brew "eza"                  # Better ls
brew "fastfetch"            # System info
brew "fzf"                  # Fuzzy finder
brew "docker"
brew "docker-completion"
brew "gdbm"
brew "gettext"
brew "grep"
brew "gti"                  # Fun typo for git
brew "htop"                 # Process viewer
brew "imagemagick"
brew "jasper"
brew "jq"                   # JSON processor
brew "little-cms2"
brew "ossp-uuid"
brew "pkg-config"
brew "readline"
brew "ripgrep"              # Fast grep (rg)
brew "rust"
brew "tmux"
brew "wget"
brew "xclip"
brew "xz"                   # File compression
brew "yazi"                 # File browser
brew "zoxide"               # Smart cd

#==============================================================================
# Development - General
#==============================================================================
brew "awscli"
brew "emacs"
brew "gh"                   # GitHub CLI
brew "git-delta"            # Better git diffs
brew "git-lfs"
brew "mob"                  # Mob programming tool
brew "neovim"
brew "qt"
brew "tig"                  # Git TUI

#==============================================================================
# Development - Kubernetes
#==============================================================================
brew "helm"
brew "kubernetes-cli"
brew "kubectx"
brew "k9s"

#==============================================================================
# Development - Java/JVM
#==============================================================================
brew "gradle"
brew "openjdk"
brew "sbt"

#==============================================================================
# Development - Python
#==============================================================================
brew "poetry"
brew "pyenv"
brew "ruff"
brew "uv"                   # Fast pip replacement

#==============================================================================
# Development - Node.js
#==============================================================================
brew "oven-sh/bun/bun"
brew "n"                    # Node version manager
brew "pnpm"
brew "yarn"

#==============================================================================
# Databases
#==============================================================================
brew "duckdb"
brew "postgresql@16"
brew "pgvector"
brew "redis"
brew "sqlite"

#==============================================================================
# AI Tools
#==============================================================================
brew "llm"                  # CLI for LLMs

#==============================================================================
# Helpers
#==============================================================================
brew "bash-completion"
brew "thefuck"              # Command correction
brew "tldr"                 # Simplified man pages

#==============================================================================
# Casks - Development Apps
#==============================================================================
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "ghostty"              # Terminal
cask "github"               # GitHub Desktop
cask "jetbrains-toolbox"
cask "kiro"
cask "lm-studio"
cask "openlens"             # Kubernetes IDE
cask "postman"
cask "windsurf"
cask "zed"                  # Editor

#==============================================================================
# Casks - General Apps
#==============================================================================
cask "adobe-creative-cloud"
cask "arc"                  # Browser
cask "conductor"
cask "dropbox"
cask "firefox"
cask "mactex"
cask "opal-composer"
cask "raycast"
cask "reflect"
cask "spotify"
cask "todoist"
cask "zoom"

#==============================================================================
# Casks - Messaging
#==============================================================================
cask "discord"
cask "slack"
cask "telegram"
cask "whatsapp"

#==============================================================================
# Fonts
#==============================================================================
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-symbols-only-nerd-font"
